In [9]:
import numpy as np
import pandas as pd

In [10]:
df = pd.DataFrame({
    "Column1":[1,2,3,4,5,6],
    "Column2":[100,100,200,300,300,100],
    "Column3":["Mustafa","Kamil","Emre","Ayşe","Murat","Zeynep"]
})

In [11]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [6]:
df.head(n=3)   #İlk 3 veriyi döndürür. head() içine değer girilmezse ilk halini döndürür. (head() içinde n=5 sabit yapıdadır)

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre

In [8]:
df["Column2"].unique()  #Column2 deki kaç farklı değer olduğunu gösterir. Tekrar eden değerleri görmede kullanılır.

array([100, 200, 300], dtype=int64)

In [10]:
df["Column2"].nunique()  #Column2 de kaç tane farklı değer olduğunu gösterir.

3

In [12]:
df["Column2"].value_counts()  #Column2 deki değerlerden kaç tane olduğunu gösterir.

100    3
300    2
200    1
Name: Column2, dtype: int64

In [13]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [16]:
df[df["Column1"]>=4] #Column1 e göre 4 e eşit ve büyük olan değerleri filtreler.

   Column1  Column2 Column3
3        4      300    Ayşe
4        5      300   Murat
5        6      100  Zeynep

In [17]:
df[(df["Column1"]>=4) & (df["Column2"]==300)] #Column1 e göre 4 e eşit ve büyük olan değerleri filtreler.
                                              #Burada sadece Column2 deki sadece 300 e eşit değerler üzerinde uygulanır.

   Column1  Column2 Column3
3        4      300    Ayşe
4        5      300   Murat

In [3]:
df

NameError: name 'df' is not defined

In [12]:
def times3(x):
    return x*3

In [13]:
df["Column2"].apply(times3)

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [14]:
df["Column2"]=df["Column2"].apply(times3)   #BU İŞLEM TABLOYU KALICI OLARAK GÜNCELLER

In [15]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [16]:
df["Column2"].apply(lambda x:x*2)  #FONKSİYON YAZMADAN BASİT ŞEKİLDE YAPILABİLİR

0     600
1     600
2    1200
3    1800
4    1800
5     600
Name: Column2, dtype: int64

In [19]:
df["Column3"].apply(len)  #STRING VARSA METİN UZUNLUĞUNU GÖREBİLİRİZ

0    7
1    5
2    4
3    4
4    5
5    6
Name: Column3, dtype: int64

In [20]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [21]:
df.drop("Column3",axis=1)  #Column ların olduğu axis 1 dir.

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [22]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [24]:
df.drop("Column3",axis=1,inplace=True)  #KALICI OLARAK SİLİNDİ.

In [25]:
df

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [26]:
df.columns  #KAÇ column OLDUĞUNU GÖRMEK İÇİN YAPILIR

Index(['Column1', 'Column2'], dtype='object')

In [28]:
df.index  #kaç index olduğunu görmek için yapılır

RangeIndex(start=0, stop=6, step=1)

In [30]:
len(df.index)  #6 tane veri satırı var

6

In [31]:
df

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [32]:
df.sort_values("Column2")  #VERİ SETİNİ COLUMN2 YE GÖRE KÜÇÜKTEN BÜYÜĞE SIRALAR

   Column1  Column2
0        1      300
1        2      300
5        6      300
2        3      600
3        4      900
4        5      900

In [34]:
df.sort_values("Column2",ascending=False)  #VERİ SETİNİ COLUMN2 YE GÖRE BÜYÜKTEN KÜÇÜĞE SIRALAR

   Column1  Column2
3        4      900
4        5      900
2        3      600
0        1      300
1        2      300
5        6      300

In [35]:
# PİVOT TABLE ...........

In [36]:
df = pd.DataFrame({
    "Ay" : ["Mart","Nisan","Mayıs","Mart","Nisan","Mayıs","Mart","Nisan","Mayıs"],
    "Şehir":["Ankara","Ankara","Ankara","İstanbul","İstanbul","İstanbul","İzmir","İzmir","İzmir"],
    "Nem":[10,25,50,21,67,80,30,70,75]
})

In [37]:
df

      Ay     Şehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  Mayıs    Ankara   50
3   Mart  İstanbul   21
4  Nisan  İstanbul   67
5  Mayıs  İstanbul   80
6   Mart     İzmir   30
7  Nisan     İzmir   70
8  Mayıs     İzmir   75

In [38]:
df.pivot_table(index="Şehir",columns="Ay",values="Nem")

Ay        Mart  Mayıs  Nisan
Şehir
Ankara      10     50     25
İstanbul    21     80     67
İzmir       30     75     70

In [40]:
df.pivot_table(index="Ay",columns="Şehir",values="Nem")

Şehir  Ankara  İstanbul  İzmir
Ay
Mart       10        21     30
Mayıs      50        80     75
Nisan      25        67     70